In [1]:
import pandas as pd
import numpy as np

In [3]:
datas = pd.date_range("20220101", periods=6)
#pega datas. Periodo. Inicio e fim. Ano, mês, dia. periods é dias a mais

In [4]:
for x in datas:
    print(x)

2022-01-01 00:00:00
2022-01-02 00:00:00
2022-01-03 00:00:00
2022-01-04 00:00:00
2022-01-05 00:00:00
2022-01-06 00:00:00

In [25]:
df = pd.DataFrame(np.random.randn(6,4))
#Gera um df. Função data frame 
#vai gerar biblioteca numpy com numeros aleatorios. 6 linhas e 4 colunas 
#gera numeros randomicos. randn é pegar numeros aleatorios respeitando distribuilçao normal com média 0 e desvio padrão 1 

df

          0         1         2         3
0 -0.548630  0.220208 -0.195819  0.649200
1  0.512755  1.385233 -0.537893 -1.192687
2 -0.591116 -0.278346 -1.205671  2.219999
3 -0.660947  1.411314 -0.394860 -0.455626
4 -0.030742 -0.323934 -0.752860 -0.501610
5 -0.743420  0.781727 -1.949866  0.864262

In [28]:
list("ABCD")

['A', 'B', 'C', 'D']

In [30]:
#df = pd.DataFrame(np.random.randn(6,4), index = datas, columns=list("ABCD"))
df = pd.DataFrame(np.random.randn(6,4), index = datas, columns= ["Carros", "Paises", "Pessoas", "Opa"])
#index é a referência da linhas. são 6 datas, 6 linhas. 
#colunas são uma lista das 4 letras.

              Carros    Paises   Pessoas       Opa
2022-01-01 -0.841835  0.533675 -0.140798  0.610635
2022-01-02  1.177307 -1.296290 -1.753287  0.368681
2022-01-03 -1.351520 -0.739974  0.511255 -0.233425
2022-01-04 -0.553084  0.052515 -1.854630 -0.704586
2022-01-05 -0.312644  0.931192  1.040388 -0.026769
2022-01-06  2.150964 -0.790827  0.750236 -0.907275

In [35]:
df2 = pd.DataFrame({"A": 7, 
                   "B": pd.Timestamp("20190101"), 
                   "C": pd.Series(1, index= list(range(4)), dtype="float32"), 
                   "D": np.array([3] * 4, dtype="int32"),
                   "E": pd.Categorical(["test", "train", "test", "train"]),
                   "F": "Python"})
#
df2

   A          B    C  D      E       F
0  7 2019-01-01  1.0  3   test  Python
1  7 2019-01-01  1.0  3  train  Python
2  7 2019-01-01  1.0  3   test  Python
3  7 2019-01-01  1.0  3  train  Python

# Pandas para Plotly

In [21]:
#Dicionario que recebe lista de valores
data = {'Nome' : ['Lucas', 'Rafael', 'Lais'],
       'Idade': [29,33,11],
        'Cidade': ['Salvador', 'Rio de Janeiro', 'São Paulo']
       }
#data['Nome']
df = pd.DataFrame(data, index = [1,2,3])
#df = pd.DataFrame(data, index = range(1, 4)) #Range 5 da erro pq nao tem 4 linhas. Ultimo valor é exclusivo
df

     Nome  Idade          Cidade
1   Lucas     29        Salvador
2  Rafael     33  Rio de Janeiro
3    Lais     11       São Paulo

In [26]:
df.index

Int64Index([1, 2, 3], dtype='int64')

In [30]:
df.columns.to_list()

['Nome', 'Idade', 'Cidade']

In [38]:
df.columns.values
#Criou um array.

array(['Nome', 'Idade', 'Cidade'], dtype=object)

In [39]:
df['Nome']

1     Lucas
2    Rafael
3      Lais
Name: Nome, dtype: object

In [42]:
type(df['Nome'])
#Series é estrutura do pandas que representa vetor unidimensional
#DataFrame tem 2 dimensões. Linha e coluna. Series é só um vetor

pandas.core.series.Series

In [44]:
df['Estado'] = ['BA', 'RJ', 'SP']
df

     Nome  Idade          Cidade Estado
1   Lucas     29        Salvador     BA
2  Rafael     33  Rio de Janeiro     RJ
3    Lais     11       São Paulo     SP

In [47]:
#loc  É tipo localizar

df.loc[2, 'Cidade']

'Rio de Janeiro'

In [48]:
linha = 1
coluna = 'Nome'
df.loc[linha, coluna]

'Lucas'

In [52]:
df.loc[2, :]
#linha 2 inteira

Nome              Rafael
Idade                 33
Cidade    Rio de Janeiro
Estado                RJ
Name: 2, dtype: object

In [53]:
df.loc[:, 'Nome']

1     Lucas
2    Rafael
3      Lais
Name: Nome, dtype: object

In [57]:
df.loc[1, 'Idade': 'Cidade']

Idade           29
Cidade    Salvador
Name: 1, dtype: object

In [61]:
df.loc[[1,3], ['Idade', 'Nome' ]]

   Idade   Nome
1     29  Lucas
3     11   Lais

In [68]:
df

     Nome  Idade          Cidade Estado
1   Lucas     29        Salvador     BA
2  Rafael     33  Rio de Janeiro     RJ
3    Lais     11       São Paulo     SP

In [72]:
#iloc pega elementos pela indexação
#linha tem indice 0,1 etc
#coluna tem indice 0,1 etc

In [65]:
#Pega da linha 1 até final, coluna 2 até o final
df.iloc[1:,2:,]

           Cidade Estado
2  Rio de Janeiro     RJ
3       São Paulo     SP

In [66]:
#pega do inicio até linha 1 e do inicio ate coluna 2
df.iloc[:2,:3]

     Nome  Idade          Cidade
1   Lucas     29        Salvador
2  Rafael     33  Rio de Janeiro

In [71]:
df.iloc[[0,2],[0,3]]
#linha 0 e linha 2
#coluna  e linha 3

    Nome Estado
1  Lucas     BA
3   Lais     SP

In [74]:
df['Idade'].mean()
#média das idades

24.333333333333332

In [75]:
df['Idade'].var()
#variancia das idades

137.33333333333331

In [78]:
df['Idade'].sum()

73

In [76]:
df['Idade'].describecribe()

count     3.000000
mean     24.333333
std      11.718931
min      11.000000
25%      20.000000
50%      29.000000
75%      31.000000
max      33.000000
Name: Idade, dtype: float64